mtongnz/ESP8266_ArtNetNode_v2/libs/espArtnetRDM/espArtNetRDM.cpp
/*
espArtNetRDM v1 (pre-release) library
Copyright (c) 2016, Matthew Tong
https://github.com/mtongnz/

This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public
License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any
later version.

This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied
warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more details.

You should have received a copy of the GNU General Public License along with this program.
If not, see http://www.gnu.org/licenses/
*/


#include "espArtNetRDM.h"

#include <ESP8266WiFi.h>
#include <WiFiUdp.h>
extern "C" {
#include "mem.h"
}



void _artClearDMXBuffer(byte* buf);


void _artClearDMXBuffer(byte* buf) {
  memset(buf, 0, DMX_BUFFER_SIZE);
  //for (uint16_t x = 0; x < DMX_BUFFER_SIZE; x++)
  //  buf[x] = 0;
}

esp8266ArtNetRDM::esp8266ArtNetRDM() {
}

esp8266ArtNetRDM::~esp8266ArtNetRDM() {
  end();
}

void esp8266ArtNetRDM::end() {
  if (_art == 0)
    return;

  eUDP.stopAll();

  for (uint8_t g = 0; g < _art->numGroups; g++) {
    for (uint8_t p = 0; p < 4; p++) {
      if (_art->group[g]->ports[p] == 0)
        continue;

      if (_art->group[g]->ports[p]->ownBuffer)
        os_free(_art->group[g]->ports[p]->dmxBuffer);

      os_free(_art->group[g]->ports[p]->ipBuffer);
      os_free(_art->group[g]->ports[p]);
    }
    os_free(_art->group[g]);
  }
  os_free(_art);

  _art = 0;
}

void esp8266ArtNetRDM::init(IPAddress ip, IPAddress subnet, bool dhcp, char* shortname, char* longname, uint16_t oem, uint16_t esta, uint8_t* mac) {
  if (_art != 0)
    os_free(_art);

  // Allocate memory for our settings
  _art = (artnet_device*) os_malloc(sizeof(artnet_device));

  delay(1);
  
  // Store values
  _art->firmWareVersion = 0;
  _art->numGroups = 0;
  _art->nodeReportCounter = 0;
  _art->nodeReportCode = ARTNET_RC_POWER_OK;
  _art->deviceIP = ip;
  _art->subnet = ip;
  _art->broadcastIP = IPAddress((uint32_t)ip | ~((uint32_t)subnet));
  _art->dhcp = dhcp;
  _art->oemLo = (byte)oem;
  _art->oemHi = (byte)(oem >> 8);
  _art->estaLo = (byte)esta;
  _art->estaHi = (byte)(esta >> 8);
  _art->syncIP = INADDR_NONE;
  _art->lastSync = 0;
  _art->nextPollReply = 0;
  memcpy(_art->shortName, shortname, ARTNET_SHORT_NAME_LENGTH);
  memcpy(_art->longName, longname, ARTNET_LONG_NAME_LENGTH);
  memcpy(_art->deviceMAC, mac, 6);
}

void esp8266ArtNetRDM::setFirmwareVersion(uint16_t fw) {
  if (_art == 0)
    return;

  _art->firmWareVersion = fw;
}

void esp8266ArtNetRDM::setDefaultIP() {
  if (_art == 0)
    return;

  _art->dhcp = false;
  _art->subnet = IPAddress(255, 0, 0, 0);
  _art->broadcastIP = IPAddress(2, 255, 255, 255);

  byte b = _art->deviceMAC[3] + _art->oemLo + _art->oemHi;
  byte c = _art->deviceMAC[4];
  byte d = _art->deviceMAC[5];

  _art->deviceIP = IPAddress(2, b, c, d);
}

uint8_t esp8266ArtNetRDM::addGroup(byte net, byte subnet) {
  if (_art == 0)
    return 255;

  uint8_t g = _art->numGroups;
  
  _art->group[g] = (group_def*) os_malloc(sizeof(group_def));
  _art->group[g]->netSwitch = net & 0b01111111;
  _art->group[g]->subnet = subnet;
  _art->group[g]->numPorts = 0;
  _art->group[g]->cancelMergeIP = INADDR_NONE;
  _art->group[g]->cancelMerge = 0;
  _art->group[g]->cancelMergeTime = 0;

  for (int x = 0; x < 4; x++)
    _art->group[g]->ports[x] = 0;
  
  _art->numGroups++;

  return g;
}

uint8_t esp8266ArtNetRDM::addPort(byte g, byte p, byte universe, uint8_t t, bool htp, byte* buf) {
  if (_art == 0)
    return 255;

  // Check for a valid universe, group and port number
  if (universe > 15 || p >= 4 || g > _art->numGroups)
    return 255;
  
  group_def* group = _art->group[g];
  
  // Check if port is already initialised, return its port number
  if (group->ports[p] != 0)
    return p;

  // Allocate space for our port
  group->ports[p] = (port_def*) os_malloc(sizeof(port_def));
  
  delay(1);
  port_def* port = group->ports[p];
  
  // DMX output buffer allocation
  if (buf == 0) {
    port->dmxBuffer = (byte*) os_malloc(DMX_BUFFER_SIZE);
    port->ownBuffer = true;
  } else {
    port->dmxBuffer = buf;
    port->ownBuffer = false;
  }

  // Clear the buffer
  _artClearDMXBuffer(port->dmxBuffer);

  
  // Store settings
  group->numPorts++;
  port->portType = t;
  port->mergeHTP = htp;
  port->portUni = universe;
  port->senderIP[0] = INADDR_NONE;
  port->senderIP[1] = INADDR_NONE;

  for (uint8_t x = 0; x < 5; x++)
    port->rdmSenderIP[x] = INADDR_NONE;

  port->ipBuffer = 0;
  port->ipChans[0] = 0;
  port->ipChans[1] = 0;
  port->dmxChans = 0;
  port->merging = 0;
  port->lastTodCommand = 0;
  port->uidTotal = 0;  
  port->todAvailable = 0;
  
  return p;
}

bool esp8266ArtNetRDM::closePort(uint8_t g, uint8_t p) {
  if (_art == 0 || g >= _art->numGroups)
    return 0;
  
  group_def* group = _art->group[g];
  
  // Port already closed
  if (group->ports[p] == 0)
    return true;

  // Delete buffers
  if (group->ports[p]->ownBuffer)
    os_free(group->ports[p]->dmxBuffer);
  if (group->ports[p]->ipBuffer != 0)
    os_free(group->ports[p]->ipBuffer);
  
  os_free(group->ports[p]);

  // Mark port as empty
  group->ports[p] = 0;
  group->numPorts--;
  group->ports[p] == 0;
}

void esp8266ArtNetRDM::setArtDMXCallback(artDMXCallBack callback) {
  if (_art == 0)
    return;

  _art->dmxCallBack = callback;
}

void esp8266ArtNetRDM::setArtSyncCallback(artSyncCallBack callback) {
  if (_art == 0)
    return;

  _art->syncCallBack = callback;
}

void esp8266ArtNetRDM::setArtRDMCallback(artRDMCallBack callback) {
  if (_art == 0)
    return;

  _art->rdmCallBack = callback;
}

void esp8266ArtNetRDM::setArtIPCallback(artIPCallBack callback) {
  if (_art == 0)
    return;

  _art->ipCallBack = callback;
}

void esp8266ArtNetRDM::setArtAddressCallback(artAddressCallBack callback) {
  if (_art == 0)
    return;

  _art->addressCallBack = callback;
}

