mtongnz/ESP8266_ArtNetNode_v2/libs/espArtnetRDM/espArtNetRDM.cpp
void esp8266ArtNetRDM::setTODRequestCallback(artTodRequestCallBack callback) {
  if (_art == 0)
    return;

  _art->todRequestCallBack = callback;
}

void esp8266ArtNetRDM::setTODFlushCallback(artTodFlushCallBack callback) {
  if (_art == 0)
    return;

  _art->todFlushCallBack = callback;
}
    
void esp8266ArtNetRDM::begin() {
  if (_art == 0)
    return;

  // Start listening for UDP packets
  eUDP.begin(ARTNET_PORT);
  eUDP.flush();
  fUDP.begin(E131_PORT);
  fUDP.flush();
  
  // Send ArtPollReply to tell everyone we're here
  artPollReply();
}
    
void esp8266ArtNetRDM::pause() {
  if (_art == 0)
    return;

  eUDP.flush();
  eUDP.stopAll();
}

void esp8266ArtNetRDM::handler() {
  if (_art == 0)
    return;

  // Artnet packet
  uint16_t packetSize = eUDP.parsePacket();

  if(packetSize > 0) {

    unsigned char _artBuffer[ARTNET_BUFFER_MAX];

    // Read data into buffer
    eUDP.read(_artBuffer, packetSize);
  
    // Get the Op Code
    int opCode = _artOpCode(_artBuffer);

    switch (opCode) {

      case ARTNET_ARTPOLL:
	// This is always called at the end of this function
        //_artPoll();
        break;

      case ARTNET_ARTDMX:
        _artDMX(_artBuffer);
        break;

      case ARTNET_IP_PROG:
        _artIPProg(_artBuffer);
        break;
  
      case ARTNET_ADDRESS:
        _artAddress(_artBuffer);
        break;
  
      case ARTNET_SYNC:
        _artSync(_artBuffer);
        break;
  
      case ARTNET_FIRMWARE_MASTER:
        _artFirmwareMaster(_artBuffer);
        break;
  
      case ARTNET_TOD_REQUEST:
        _artTODRequest(_artBuffer);
        break;
  
      case ARTNET_TOD_CONTROL:
        _artTODControl(_artBuffer);
        break;
  
      case ARTNET_RDM:
        _artRDM(_artBuffer, packetSize);
        break;
  
      case ARTNET_RDM_SUB:
        _artRDMSub(_artBuffer);
        break;
    }
  }


  // e131 packet
  packetSize = fUDP.parsePacket();

  if(packetSize > 0) {

    e131_packet_t _e131Buffer;

    // Read data into buffer
    fUDP.readBytes(_e131Buffer.raw, packetSize);

    _e131Receive(&_e131Buffer);
  }

  // Send artPollReply - the function will limit the number sent
  _artPoll();

}

int esp8266ArtNetRDM::_artOpCode(unsigned char *_artBuffer) {
  String test = String((char*)_artBuffer);
  if ( test.equals("Art-Net") ) {
    if ( _artBuffer[11] >= 14 ) {                 //protocol version [10] hi byte [11] lo byte
      return _artBuffer[9] *256 + _artBuffer[8];  //opcode lo byte first
    }
  }
  
  return 0;
}


void esp8266ArtNetRDM::_artPoll() {
  // limit the number of artPollReply messages
  if (_art->nextPollReply > millis())
    return;
  _art->nextPollReply = millis() + 2000;
  
  unsigned char _artReplyBuffer[ARTNET_REPLY_SIZE];
  _artReplyBuffer[0] = 'A';
  _artReplyBuffer[1] = 'r';
  _artReplyBuffer[2] = 't';
  _artReplyBuffer[3] = '-';
  _artReplyBuffer[4] = 'N';
  _artReplyBuffer[5] = 'e';
  _artReplyBuffer[6] = 't';
  _artReplyBuffer[7] = 0;
  _artReplyBuffer[8] = ARTNET_ARTPOLL_REPLY;      	// op code lo-hi
  _artReplyBuffer[9] = ARTNET_ARTPOLL_REPLY >> 8; 	// 0x2100 = artPollReply
  _artReplyBuffer[10] = _art->deviceIP[0];        	// ip address
  _artReplyBuffer[11] = _art->deviceIP[1];
  _artReplyBuffer[12] = _art->deviceIP[2];
  _artReplyBuffer[13] = _art->deviceIP[3];
  _artReplyBuffer[14] = 0x36;               		// port lo first always 0x1936
  _artReplyBuffer[15] = 0x19;
  _artReplyBuffer[16] = _art->firmWareVersion >> 8;     // firmware hi-lo
  _artReplyBuffer[17] = _art->firmWareVersion;
  _artReplyBuffer[20] = _art->oemHi;                    // oem hi-lo
  _artReplyBuffer[21] = _art->oemLo;
  _artReplyBuffer[22] = 0;              		// ubea
	
  _artReplyBuffer[23] = 0b11110010;			// Device is RDM Capable
  _artReplyBuffer[24] = _art->estaLo;           	// ESTA Code (2 bytes)
  _artReplyBuffer[25] = _art->estaHi;

                                        //short name
  for (int x = 0; x < ARTNET_SHORT_NAME_LENGTH; x++)
    _artReplyBuffer[x+26] = _art->shortName[x];
    
                                        //long name
  for (int x = 0; x < ARTNET_LONG_NAME_LENGTH; x++)
    _artReplyBuffer[x+44] = _art->longName[x];

                                        // node report - send blank
  for (int x = 0; x < ARTNET_NODE_REPORT_LENGTH; x++) {
    _artReplyBuffer[x+108] = 0;
  }


  // Set reply code
  char tmp[7];
  sprintf (tmp, "%04x", _art->nodeReportCode);
  _artReplyBuffer[108] = '#';
  _artReplyBuffer[109] = tmp[0];
  _artReplyBuffer[110] = tmp[1];
  _artReplyBuffer[111] = tmp[2];
  _artReplyBuffer[112] = tmp[3];
  _artReplyBuffer[113] = '[';

  // Max 6 digits for counter - could be longer if wanted
  sprintf (tmp, "%d", _art->nodeReportCounter++);
  if (_art->nodeReportCounter > 999999)
    _art->nodeReportCounter = 0;

  // Format counter and add to reply buffer
  uint8_t x = 0;
  for (x = 0; tmp[x] != '\0' && x < 6; x++)
    _artReplyBuffer[x + 114] = tmp[x];

  uint8_t rLen = ARTNET_NODE_REPORT_LENGTH - x - 2;
  x = x + 114;

  _artReplyBuffer[x++] = ']';
  _artReplyBuffer[x++] = ' ';

  // Append plain text report
  for (uint8_t y = 0; y < rLen && _art->nodeReport[y] != '\0'; y++)
    _artReplyBuffer[x++] = _art->nodeReport[y];


  _artReplyBuffer[172] = 0;             //number of ports Hi (always 0)
  _artReplyBuffer[194] = 0;             // these are not used
  _artReplyBuffer[195] = 0;
  _artReplyBuffer[196] = 0;
  _artReplyBuffer[197] = 0;
  _artReplyBuffer[198] = 0;
  _artReplyBuffer[199] = 0;
  _artReplyBuffer[200] = 0;             // Style - 0x00 = DMX to/from Artnet

  for (int x = 0; x < 6; x++)           // MAC Address
    _artReplyBuffer[201 + x] = _art->deviceMAC[x];

  _artReplyBuffer[207] = _art->deviceIP[0];        // bind ip
  _artReplyBuffer[208] = _art->deviceIP[1];
  _artReplyBuffer[209] = _art->deviceIP[2];
  _artReplyBuffer[210] = _art->deviceIP[3];
  
  _artReplyBuffer[212] = (_art->dhcp) ? 31 : 29;  // status 2

  for (int x = 213; x < ARTNET_REPLY_SIZE; x++)
    _artReplyBuffer[x] = 0;             // Reserved for future - transmit 0


  // Set values for each group of ports and send artPollReply
  for (uint8_t groupNum = 0; groupNum < _art->numGroups; groupNum++) {
    group_def* group = _art->group[groupNum];
    
