mtongnz/ESP8266_ArtNetNode_v2/libs/espArtnetRDM/espArtNetRDM.cpp
/*
    // Delete merge buffer if it exists
    if (port->ipBuffer != 0) {
      os_free(port->ipBuffer);
      port->ipBuffer = 0;
    }
*/

    // Check if Sync is enabled and call dmx callback in the main script
    if (_art->lastSync == 0 || (_art->lastSync + 4000) < timeNow || _art->syncIP != rIP)
      _art->dmxCallBack(groupNum, portNum, numberOfChannels, false);
    else
      _art->dmxCallBack(groupNum, portNum, numberOfChannels, true);

//    _art->syncIP = rIP;
  }
}

byte* esp8266ArtNetRDM::getDMX(uint8_t g, uint8_t p) {
  if (_art == 0)
    return NULL;

  if (g < _art->numGroups) {
    if (_art->group[g]->ports[p] != 0)
      return _art->group[g]->ports[p]->dmxBuffer;
  }
  return NULL;
}

uint16_t esp8266ArtNetRDM::numChans(uint8_t g, uint8_t p) {
  if (_art == 0)
    return 0;

  if (g < _art->numGroups) {
    if (_art->group[g]->ports[p] != 0)
      return _art->group[g]->ports[p]->dmxChans;
  }
  return 0;
}

void esp8266ArtNetRDM::_artIPProg(unsigned char *_artBuffer) {
  // Don't do anything if it's the same command again
  if ((_art->lastIPProg + 20) > millis())
    return;
  _art->lastIPProg = millis();
  
  byte command = _artBuffer[14];

  // Enable DHCP
  if ((command & 0b11000000) == 0b11000000) {
    _art->dhcp = true;

  // Disable DHCP
  }else if ((command & 0b11000000) == 0b10000000) {
    _art->dhcp = false;
    
    // Program IP
    if ((command & 0b10000100) == 0b10000100)
      _art->deviceIP = IPAddress(_artBuffer[16], _artBuffer[17], _artBuffer[18], _artBuffer[19]);
      
    // Program subnet
    if ((command & 0b10000010) == 0b10000010) {
      _art->subnet = IPAddress(_artBuffer[20], _artBuffer[21], _artBuffer[22], _artBuffer[23]);
      _art->broadcastIP = IPAddress((uint32_t)_art->deviceIP | ~((uint32_t)_art->subnet));
    }

    // Use default address
    if ((command & 0b10001000) == 0b10001000)
      setDefaultIP();
  }
  
  // Run callback - must be before reply for correct dhcp setting
  if (_art->ipCallBack != 0)
    _art->ipCallBack();
  
  // Send reply
  _artIPProgReply();

  // Send artPollReply
  artPollReply();
}

void esp8266ArtNetRDM::_artIPProgReply() {
  // Initialise our reply
  char ipProgReply[ARTNET_IP_PROG_REPLY_SIZE];
  
  ipProgReply[0] = 'A';
  ipProgReply[1] = 'r';
  ipProgReply[2] = 't';
  ipProgReply[3] = '-';
  ipProgReply[4] = 'N';
  ipProgReply[5] = 'e';
  ipProgReply[6] = 't';
  ipProgReply[7] = 0;
  ipProgReply[8] = ARTNET_IP_PROG_REPLY;      // op code lo-hi
  ipProgReply[9] = ARTNET_IP_PROG_REPLY >> 8; // 0x2100 = artPollReply
  ipProgReply[10] = 0;
  ipProgReply[11] = 14;                 // artNet version (14)
  ipProgReply[12] = 0;
  ipProgReply[13] = 0;
  ipProgReply[14] = 0;
  ipProgReply[15] = 0;
  ipProgReply[16] = _art->deviceIP[0];  // ip address
  ipProgReply[17] = _art->deviceIP[1];
  ipProgReply[18] = _art->deviceIP[2];
  ipProgReply[19] = _art->deviceIP[3];
  ipProgReply[20] = _art->subnet[0];    // subnet address
  ipProgReply[21] = _art->subnet[1];
  ipProgReply[22] = _art->subnet[2];
  ipProgReply[23] = _art->subnet[3];
  ipProgReply[24] = 0;
  ipProgReply[25] = 0;
  ipProgReply[26] = (_art->dhcp)?(1 << 6) : 0;  // DHCP enabled
  ipProgReply[27] = 0;
  ipProgReply[28] = 0;
  ipProgReply[29] = 0;
  ipProgReply[30] = 0;
  ipProgReply[31] = 0;
  ipProgReply[32] = 0;
  ipProgReply[33] = 0;

  // Send packet
  eUDP.beginPacket(eUDP.remoteIP(), ARTNET_PORT);
  int test = eUDP.write(ipProgReply,ARTNET_IP_PROG_REPLY_SIZE);
  eUDP.endPacket();
}

void esp8266ArtNetRDM::_artAddress(unsigned char *_artBuffer) {
  // _artBuffer[13]    bindIndex
  uint8_t g = _artBuffer[13] - 1;

  // Set net switch
  if ((_artBuffer[12] & 0x80) == 0x80)
    _art->group[g]->netSwitch = _artBuffer[12] & 0x7F;
  
  // Set short name
  if (_artBuffer[14] != '\0') {
    for (int x = 0; x < ARTNET_SHORT_NAME_LENGTH; x++)
      _art->shortName[x] = _artBuffer[x + 14];
  }

  // Set long name
  if (_artBuffer[32] != '\0') {
    for (int x = 0; x < ARTNET_LONG_NAME_LENGTH; x++)
      _art->longName[x] = _artBuffer[x + 32];
  }

  // Set Port Address
  for (int x = 0; x < 4; x++) {
    if ((_artBuffer[100 + x] & 0xF0) == 0x80 && _art->group[g]->ports[x] != 0)
      _art->group[g]->ports[x]->portUni = _artBuffer[100 + x] & 0x0F;
  }

  // Set subnet
  if ((_artBuffer[104] & 0xF0) == 0x80) {
    _art->group[g]->subnet = _artBuffer[104] & 0x0F;
  }

  // Get port number
    uint8_t p = _artBuffer[106] & 0x0F;

  // Command
  switch (_artBuffer[106]) {
    case ARTNET_AC_CANCEL_MERGE:
      _art->group[g]->cancelMergeTime = millis();
      _art->group[g]->cancelMergeIP = eUDP.remoteIP();

      /*
      for (int x = 0; x < 4; x++) {
        if (_art->group[g]->ports[x] == 0)
          continue;
        
        // Delete merge buffer if it exists
        if (_art->group[g]->ports[x]->ipBuffer != 0) {
          os_free(_art->group[g]->ports[x]->ipBuffer);
          _art->group[g]->ports[x]->ipBuffer = 0;
        }
        
        // Update our timer variables
        _art->group[g]->ports[x]->lastPacketTime[0] = 0;
        _art->group[g]->ports[x]->lastPacketTime[1] = 0;
      }
      */
      break;
      
    case ARTNET_AC_MERGE_LTP_0:
    case ARTNET_AC_MERGE_LTP_1:
    case ARTNET_AC_MERGE_LTP_2:
    case ARTNET_AC_MERGE_LTP_3:
      if (_art->group[g]->ports[p] != 0) {
        // Delete merge buffer if it exists
        if (_art->group[g]->ports[p]->ipBuffer != 0) {
          os_free(_art->group[g]->ports[p]->ipBuffer);
          _art->group[g]->ports[p]->ipBuffer = 0;
        }
        
        // Update our timer variables
        _art->group[g]->ports[p]->lastPacketTime[0] = 0;
        _art->group[g]->ports[p]->lastPacketTime[1] = 0;
  
        // Set to LTP
        _art->group[g]->ports[p]->mergeHTP = false;
  
        // Cancel the cancel merge
        _art->group[g]->cancelMerge = 0;
        _art->group[g]->cancelMergeIP = INADDR_NONE;
      }
      break;
      
    case ARTNET_AC_MERGE_HTP_0:
    case ARTNET_AC_MERGE_HTP_1:
    case ARTNET_AC_MERGE_HTP_2:
    case ARTNET_AC_MERGE_HTP_3:
      // Set to HTP
      if (_art->group[g]->ports[p] != 0) {
        _art->group[g]->ports[p]->mergeHTP = true;

