mtongnz/ESP8266_ArtNetNode_v2/libs/espArtnetRDM/espArtNetRDM.cpp
        // Cancel the cancel merge
        _art->group[g]->cancelMerge = 0;
        _art->group[g]->cancelMergeIP = INADDR_NONE;
      }
      break;
      
    case ARTNET_AC_CLEAR_OP_0:
    case ARTNET_AC_CLEAR_OP_1:
    case ARTNET_AC_CLEAR_OP_2:
    case ARTNET_AC_CLEAR_OP_3:
      if (_art->group[g]->ports[p] == 0) {
        // Delete merge buffer if it exists
        if (_art->group[g]->ports[p]->ipBuffer != 0) {
          os_free(_art->group[g]->ports[p]->ipBuffer);
          _art->group[g]->ports[p]->ipBuffer = 0;
        }

        // Clear the DMX output buffer
        _artClearDMXBuffer(_art->group[g]->ports[p]->dmxBuffer);
      }
      break;


    case ARTNET_AC_ARTNET_SEL_0:
    case ARTNET_AC_ARTNET_SEL_1:
    case ARTNET_AC_ARTNET_SEL_2:
    case ARTNET_AC_ARTNET_SEL_3:
      for (uint8_t x = 0; x < 4; x++) {
        if (_art->group[g]->ports[x] == 0)
          setE131(g, x, false);
      }
      break;

    case ARTNET_AC_ACN_SEL_0:
    case ARTNET_AC_ACN_SEL_1:
    case ARTNET_AC_ACN_SEL_2:
    case ARTNET_AC_ACN_SEL_3:
      for (uint8_t x = 0; x < 4; x++) {
        if (_art->group[g]->ports[p] == 0)
          setE131(g, p, true);
      }
      break;

  }

  // Send reply
  artPollReply();
  
  // Run callback
  if (_art->addressCallBack != 0)
    _art->addressCallBack();
}

void esp8266ArtNetRDM::_artSync(unsigned char *_artBuffer) {
  // Update sync timer
  _art->lastSync = millis();
  
  // Run callback
  if (_art->syncCallBack != 0)// && _art->syncIP == eUDP.remoteIP())
    _art->syncCallBack();
}

void esp8266ArtNetRDM::_artFirmwareMaster(unsigned char *_artBuffer) {
  //Serial.println("artFirmwareMaster");
}

void esp8266ArtNetRDM::_artTODRequest(unsigned char *_artBuffer) {
  byte net = _artBuffer[21];
  group_def* group;

  uint8_t numAddress = _artBuffer[23];
  uint8_t addr = 24;

  // Handle artTodControl requests
  if (_artOpCode(_artBuffer) == ARTNET_TOD_CONTROL) {
    numAddress = 1;
    addr = 23;
  }
  
  for (int g = 0; g < _art->numGroups; g++) {
    group = _art->group[g];
    
    // Net matches so loop through the addresses
    if (group->netSwitch == net) {
      for (int y = 0; y < numAddress; y++) {
        
        // Subnet doesn't match, try the next address
        if (group->subnet != (_artBuffer[addr+y] >> 4))
          continue;

        // Subnet matches so loop through the 4 ports and check universe
        for (int p = 0; p < 4; p++) {
          
          if (group->ports[p] == 0)
            continue;
          
          port_def* port = group->ports[p];
          
          if (port->portUni != (_artBuffer[addr+y] & 0x0F))
            continue;

          port->lastTodCommand = millis();
          
          // Flush TOD
          if (_artBuffer[22] == 0x01)
            _art->todFlushCallBack(g, p);
          
          // TOD Request
          else
            _art->todRequestCallBack(g, p);
        }
      }

      
    }
  }

}

void esp8266ArtNetRDM::artTODData(uint8_t g, uint8_t p, uint16_t* uidMan, uint32_t* uidDev, uint16_t uidTotal, uint8_t state) {
  if (_art == 0)
    return;

  // Initialise our reply
  uint16_t len = ARTNET_TOD_DATA_SIZE + (6 * uidTotal);
  char artTodData[len];
  artTodData[0] = 'A';
  artTodData[1] = 'r';
  artTodData[2] = 't';
  artTodData[3] = '-';
  artTodData[4] = 'N';
  artTodData[5] = 'e';
  artTodData[6] = 't';
  artTodData[7] = 0;
  artTodData[8] = ARTNET_TOD_DATA;      // op code lo-hi
  artTodData[9] = ARTNET_TOD_DATA >> 8;
  artTodData[10] = 0;
  artTodData[11] = 14;                 // artNet version (14)
  artTodData[12] = 0x01;               // rdm standard Ver 1.0
  artTodData[13] = p+1;                // port number (1-4 not 0-3)
  artTodData[14] = 0;
  artTodData[15] = 0;
  artTodData[16] = 0;
  artTodData[17] = 0;
  artTodData[18] = 0;
  artTodData[19] = 0;
  artTodData[20] = g+1;                // bind index
  artTodData[21] = _art->group[g]->netSwitch;

  if (state == RDM_TOD_READY)
    artTodData[22] = 0x00;             // TOD full
  else
    artTodData[22] = 0xFF;             // TOD not avail or incomplete

  artTodData[23] = (_art->group[g]->subnet << 4) | _art->group[g]->ports[p]->portUni;
  artTodData[24] = uidTotal >> 8;      // number of RDM devices found
  artTodData[25] = uidTotal;

  uint8_t blockCount = 0;
  uint16_t uidPos = 0;
  
  uint16_t f = uidTotal;

  while (1) {
    artTodData[26] = blockCount;
    artTodData[27] = (uidTotal > 200) ? 200 : uidTotal;
    
    uint8_t uidCount = 0;

    // Add RDM UIDs (48 bit each) - max 200 per packet
    for (uint16_t xx = 28; uidCount < 200 && uidTotal > 0; uidCount++) {
      uidTotal--;
      
      artTodData[xx++] = uidMan[uidTotal] >> 8;
      artTodData[xx++] = uidMan[uidTotal];
      artTodData[xx++] = uidDev[uidTotal] >> 24;
      artTodData[xx++] = uidDev[uidTotal] >> 16;
      artTodData[xx++] = uidDev[uidTotal] >> 8;
      artTodData[xx++] = uidDev[uidTotal];
    }

    // Send packet
    eUDP.beginPacket(_art->broadcastIP, ARTNET_PORT);
    int test = eUDP.write(artTodData,len);
    eUDP.endPacket();

    if (uidTotal == 0)
      break;

    blockCount++;
  }
}

void esp8266ArtNetRDM::_artTODControl(unsigned char *_artBuffer) {
  _artTODRequest(_artBuffer);
}

void esp8266ArtNetRDM::_artRDM(unsigned char *_artBuffer, uint16_t packetSize) {
  if (_art->rdmCallBack == 0)
    return;

  IPAddress remoteIp = eUDP.remoteIP();

  byte net = _artBuffer[21] * 0x7F;
  byte sub = _artBuffer[23] >> 4;
  byte uni = _artBuffer[23] & 0x0F;

  // Get RDM data into out buffer ready to send
  rdm_data c;
  c.buffer[0] = 0xCC;
  memcpy (&c.buffer[1], &_artBuffer[24], _artBuffer[25] + 2);

  group_def* group = 0;
  unsigned long timeNow = millis();
  
  // Get the group number
  for (int x = 0; x < _art->numGroups; x++) {
    if (net == _art->group[x]->netSwitch && sub == _art->group[x]->subnet) {
      group = _art->group[x];

      // Get the port number
      for (int y = 0; y < 4; y++) {

        // If the port isn't in use
        if (group->ports[y] == 0 || group->ports[y]->portType != RDM_OUT)
          continue;

        // Run callback
        if (uni == group->ports[y]->portUni) {
          _art->rdmCallBack(x, y, &c);

