mtongnz/ESP8266_ArtNetNode_v2/libs/espArtnetRDM/espArtNetRDM.cpp
  for (uint16_t x = 0; x < length; x++)
    _artDMX[18 + x] = data[x];

  // Send packet
  eUDP.beginPacket(bcAddress, ARTNET_PORT);
  eUDP.write(_artDMX,(18 + length));
  eUDP.endPacket();

}

void esp8266ArtNetRDM::setE131(uint8_t g, uint8_t p, bool a) {
  if (_art == 0 || _art->numGroups <= g || _art->group[g]->ports[p] == 0)
    return;

  // Increment or decrement our e131Count variable
  if (!_art->group[g]->ports[p]->e131 && a) {
    e131Count+=1;

    // Clear the DMX output buffer
    _artClearDMXBuffer(_art->group[g]->ports[p]->dmxBuffer);

  } else if (_art->group[g]->ports[p]->e131 && !a) {
    e131Count-=1;

    // Clear the DMX output buffer
    _artClearDMXBuffer(_art->group[g]->ports[p]->dmxBuffer);
  }

  _art->group[g]->ports[p]->e131 = a;
}

bool esp8266ArtNetRDM::getE131(uint8_t g, uint8_t p) {
  if (_art == 0 || _art->numGroups <= g || _art->group[g]->ports[p] == 0 || _art->group[g]->ports[p]->e131 == false)
    return false;

  return true;
}

void esp8266ArtNetRDM::setE131Uni(uint8_t g, uint8_t p, uint16_t u) {
  if (_art == 0 || _art->numGroups <= g || _art->group[g]->ports[p] == 0)
    return;

  _art->group[g]->ports[p]->e131Uni = u;
  _art->group[g]->ports[p]->e131Sequence = 0;
  _art->group[g]->ports[p]->e131Priority = 0;
}

void esp8266ArtNetRDM::_e131Receive(e131_packet_t* e131Buffer) {
  if (_art == 0 || _art->numGroups == 0 || e131Count == 0)
    return;

  // Check for sACN packet errors.  Error reporting not implemented -> just dump packet

  if (memcmp(e131Buffer->acn_id, ACN_ID, sizeof(e131Buffer->acn_id)))
    //return ERROR_ACN_ID;
    return;

  if (__builtin_bswap32(e131Buffer->root_vector) != VECTOR_ROOT)
    //return ERROR_VECTOR_ROOT;
    return;

  if (__builtin_bswap32(e131Buffer->frame_vector) != VECTOR_FRAME)
    //return ERROR_VECTOR_FRAME;
    return;

  if (e131Buffer->dmp_vector != VECTOR_DMP)
    //return ERROR_VECTOR_DMP;
    return;


  // No errors -> continue with sACN processing


  uint16_t uni = (e131Buffer->universe << 8) | ((e131Buffer->universe >> 8) & 0xFF);
  uint16_t numberOfChannels = (e131Buffer->property_value_count << 8) | ((e131Buffer->property_value_count >> 8) & 0xFF) - 1;
  uint16_t startChannel = (e131Buffer-> first_address << 8) | ((e131Buffer-> first_address >> 8) & 0xFF);
  uint16_t seq = e131Buffer->sequence_number;

  uint8_t _e131Count = 0;

  group_def* group = 0;

  IPAddress rIP = fUDP.remoteIP();

  // Loop through all groups
  for (int x = 0; x < _art->numGroups; x++) {
      group = _art->group[x];

      // Loop through each port
      for (int y = 0; y < 4; y++) {
        if (group->ports[y] == 0 || group->ports[y]->portType == DMX_IN || !group->ports[y]->e131)
          continue;
        
        // If this port has the correct Uni, is a later packet, and is of a valid priority -> save DMX to buffer
        if (uni == group->ports[y]->e131Uni && seq > group->ports[y]->e131Sequence && e131Buffer->priority >= group->ports[y]->e131Priority) {

          // Drop non-zero start packets
          if (e131Buffer->property_values[0] != 0)
            continue;

          // A higher priority will override previous data - this is handled in saveDMX but we need to clear the IPs & buffer
          if (e131Buffer->priority > group->ports[y]->e131Priority) {
            _artClearDMXBuffer(group->ports[y]->dmxBuffer);
            group->ports[y]->senderIP[0] = INADDR_NONE;
            group->ports[y]->senderIP[1] = INADDR_NONE;
          }

          group->ports[y]->e131Priority = e131Buffer->priority;

          _saveDMX(&e131Buffer->property_values[1], numberOfChannels, x, y, rIP, startChannel);
        }

        // If all the e131 ports are checked, then return
        if (e131Count == ++_e131Count)
          return;
      }
  }

}





